<a href="https://colab.research.google.com/github/JimKing100/DS-Unit-3-Sprint-2-SQL-and-Databases/blob/master/Sprint_Prep.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### Create, Insert, Update, Query and Join Sqlite DB

In [0]:
import sqlite3

In [0]:
conn = sqlite3.connect('/content/sprint_prep.sqlite3')

In [4]:
query1 = """
CREATE TABLE IF NOT EXISTS Employee (Id int, Name varchar(255), Salary int, DepartmentId int);
"""
curs1 = conn.cursor()
curs1.execute(query1)

In [5]:
query2 = """
CREATE TABLE IF NOT EXISTS Department (Id int, Name varchar(255));
"""

curs2 = conn.cursor()
curs2.execute(query2)

In [9]:
query3 = """
DELETE FROM Employee
"""

curs3 = conn.cursor()
curs3.execute(query3)

In [10]:
query4 = """
INSERT INTO Employee (Id, Name, Salary, DepartmentId) values ('1', 'Joe', '85000', '1'),
                                                             ('2', 'Henry', '80000', '2'),
                                                             ('3', 'Sam', '60000', '2'),
                                                             ('4', 'Max', '90000', '1'),
                                                             ('5', 'Janet', '69000', '1'),
                                                             ('6', 'Randy', '85000', '1'),
                                                             ('7', 'Will', '70000', '1');
"""

curs4 = conn.cursor()
curs4.execute(query4)

In [11]:
query5 = """
DELETE FROM Department
"""
query6 = """
INSERT INTO Department (Id, Name) values ('1', 'IT'),
                                         ('2', 'Sales');
"""

curs5 = conn.cursor()
curs5.execute(query5)
curs6 = conn.cursor()
curs6.execute(query6)

In [13]:
query7 = """
SELECT D.Name AS Department, E.Name AS Employee, E.Salary AS Salary 
FROM Employee E INNER JOIN Department D ON E.DepartmentId = D.Id 
ORDER by E.DepartmentId, E.Salary DESC;
"""

curs7 = conn.cursor()
print(curs7.execute(query7).fetchall())

[('IT', 'Max', 90000), ('IT', 'Joe', 85000), ('IT', 'Randy', 85000), ('IT', 'Will', 70000), ('IT', 'Janet', 69000), ('Sales', 'Henry', 80000), ('Sales', 'Sam', 60000)]

In [16]:
query8 = """
UPDATE EMPLOYEE
SET Salary = '87000'
WHERE Id = 1
"""

curs8 = conn.cursor()
curs8.execute(query8).fetchall()
print(curs7.execute(query7).fetchall())

[('IT', 'Max', 90000), ('IT', 'Joe', 87000), ('IT', 'Randy', 85000), ('IT', 'Will', 70000), ('IT', 'Janet', 69000), ('Sales', 'Henry', 80000), ('Sales', 'Sam', 60000)]